results/final/nginx-scx-compare-20260724-tested-2541464-runs10/run-1/noisy_scx_psi_wrk.txt
Running 10s test @ http://127.0.0.1:18082/
  2 threads and 32 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency    44.40ms  161.38ms   1.01s    93.45%
    Req/Sec     5.50k     2.91k   10.36k    62.36%
  Latency Distribution
     50%    2.68ms
     75%    3.89ms
     90%    9.01ms
     99%  887.09ms
  99183 requests in 10.08s, 17.31MB read
Requests/sec:   9840.69
Transfer/sec:      1.72MB